// lesson 1. Как проходить данный курс
// lesson 2. Почему этот курс?
// lesson 3. Условные обозначения и материалы
// lesson 4. Настройка рабочего пространства
// lesson 5. Про редакторы кода и учебники
// lesson 6. (д) Eslint. Подсказки об ошибках и автоматическое форматирование кода
// lesson 7. Что такое JS и как его подключить к странице
// lesson 8. Про упражнения и дополнительные уроки
// lesson 9. Переменные и строгий режим
// lesson 10. (д) Правила и типы названия переменных
// lesson 11. Классификация типов данных в JavaScript
// lesson 12. (д) Разница между объектами и массивами и неочевидные синтаксические возможности
// lesson Coding Exercise 2: Задание на создание правильных типов данных
// lesson 13. Простое общение с пользователем
// lesson 14. Интерполяция (ES6)
// lesson 15. Операторы в JS
// lesson 16. Учимся работать с системой контроля версий Git и с сервисом GitHub
// lesson 17. Как работать с GitHub с разных компьютеров, gitignore и Git Kraken
// lesson 18. (д) Сетевые протоколы. Подключение компьютера к аккаунту Github через SSH
// lesson 19. Практика, ч.1. Начинаем создавать приложение
// lesson 20. Условия
// lesson 21. (д) Логические операторы
// lesson 22. Циклы
// lesson 23. (д) Цикл в цикле и метки
// Coding Exercise 3: Задания на использование циклов и условий
// Coding Exercise 4: (*) Продвинутые задания на использование циклов и условий
// Coding Exercise 5: (**) Задача на формирование фигуры
// lesson 24. Практика, ч2. Применяем условия и циклы
// lesson 25. Функции, стрелочные ф-ции (ES6)
// lesson 26. (д) Еще раз про аргументы функций
// lesson 27. (д) Про важность return
// Coding Exercise 6: Задание на работу с функциями
// lesson 28. Методы и свойства строк и чисел
// lesson 29. Практика , ч3. Используем функции
// Coding Exercise 7: (*) Продвинутые задания на использование функций
// Coding Exercise 8: (*) Продвинутые задания на использование функций
// Coding Exercise 9: (**) Задача с собеседований на числа Фибоначчи
// lesson 30. (д) Метод trim()
// lesson 31. Callback- функции
// lesson 32. Объекты, деструктуризация объектов (ES6)
// lesson 33. Массивы и псевдомассивы
// lesson 35. Передача по ссылке или по значению, Spread оператор (ES6-ES9)
// Coding Exercise 10: Задачи на работу с объектами
// Coding Exercise 11: Задачи на работу с массивами
// Coding Exercise 12: Задачи на работу с массивами, часть 2
// lesson 36. Основы ООП, прототипно-ориентированное наследование
// lesson 37. Практика , ч4. Используем объекты
// Coding Exercise 13: (*) Продвинутая задача на работу с объектами и массивами
// Coding Exercise 14: (*) Продвинутая задача на работу с объектами и массивами
// lesson 38. Отлавливаем ошибки в своем коде при помощи консоли разроботчика. Breakpoints
// lesson 39. Динамическая типизация в JS
// lesson 40. Замыкание и лексическое окружение
// lesson 41. Задачи с собеседований на понимание основ
// Coding Exercise 15: Задания на поиск ошибок в коде
// lesson 42. Получение элементов со страницы
// lesson 43. Действия с элементами на странице
// lesson 44. Практика. Задание на отработку действий со страницей
// lesson 45. События и их обработчики
// lesson 46. Навигация по DOM - элементам, data-атрибуты, преимущество for/of
// lesson 47. Рекурсия
// linux today
// linux today
// linux today
// linux today
// linux today





