// lesson 1. Как проходить данный курс
// lesson 2. Почему этот курс?
// lesson 3. Условные обозначения и материалы
// lesson 4. Настройка рабочего пространства
// lesson 5. Про редакторы кода и учебники
// lesson 6. (д) Eslint. Подсказки об ошибках и автоматическое форматирование кода
// lesson 7. Что такое JS и как его подключить к странице
// lesson 8. Про упражнения и дополнительные уроки
// lesson 9. Переменные и строгий режим
// lesson 10. (д) Правила и типы названия переменных
// lesson 11. Классификация типов данных в JavaScript
// lesson 12. (д) Разница между объектами и массивами и неочевидные синтаксические возможности